<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Логинов Максим</title>
    <style>
        pre {
            color: gray;
            font: 400 18px "Times New Roman", serif;
        }
        h4 {
            margin-bottom: 5px;
        }
    </style>
</head>
<body>
<h2>Задание 1</h2>
<pre>
С помощью цикла while выведите все числа в промежутке от 0 до 100, которые
делятся на 3 без остатка.
</pre>
<p>
<h4>Ответ:</h4>
<?php
$x = 0;
while ($x++ <= 100) {
    if ($x % 3 == 0) {
        echo $x . ' | ';
    }
}
?>
</p>
<hr><!--======================================================================================-->
<h2>Задание 2</h2>
<pre>
С помощью цикла do…while напишите функцию для вывода чисел от 0 до 10,
чтобы результат выглядел так:
0 – это ноль
1 – нечетное число
2 – четное число
3 – нечетное число
…
10 – четное число
</pre>
<p>
<h4>Ответ:</h4>
<?php
//function oddEven($y) {
//    do {
//        if ($y != 0) {
//            if ($y % 2 == 0) {
//                echo $y . ' - это четное число<br>';
//            } else {
//                echo $y . ' - это нечетное число<br>';
//            }
//        } else {
//            echo $y . ' - это ноль<br>';
//        }
//        $y++;
//    } while ($y <= 10);
//}
//$num = 0;
//oddEven($num);

// При помощи массива
function oddEven($x,$y) {
    do {
        if ($y != 0) {
            if ($y % 2 == 0) {
                $x[$y] = "четное число";
            } else {
                $x[$y] = "нечетное число";
            }
        } else {
            $x[$y] = "ноль";
        }
    } while (++$y <= 10);
    foreach ($x as $key => $value) {
        echo $key . ' - это ' . $value . '<br>';
    }
}
$arr = null;
$num = 0;
oddEven($arr, $num);
?>
</p>
<hr><!--======================================================================================-->
<h2>Задание 3</h2>
<pre>
Выведите с помощью цикла for числа от 0 до 9, НЕ
используя тело цикла. То есть выглядеть должно вот так:
for(…){// здесь пусто}
</pre>
<p>
<h4>Ответ:</h4>
<?php
for ($i = 0; $i < 10; print $i++ . '<br>'); // точку с запятой в конце строки можно не ставить
?>
</p>
<hr><!--======================================================================================-->
<h2>Задание 4</h2>
<pre>
Объявите массив, где в качестве ключей будут использоваться названия областей, а
в качестве значений – массивы с названиями городов из соответствующей области.
Выведите в цикле значения массива, чтобы результат был таким:
Московская область:
 Москва, Зеленоград, Клин
Ленинградская область:
 Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область
 …
</pre>
<p>
<h4>Ответ:</h4>
<?php
$subjectRusFed = [
    'Приморский край' => ['Владивосток', 'Артем', 'Арсеньев', 'Дальнегорск', 'Находка', 'Уссурийск'],
    'Амурская область' => ['Благовещенск', 'Белогорск', 'Зея', 'Райчихинск', 'Свободный', 'Тында', 'Шимановск'],
    'Костромская область' => ['Кострома', 'Сусанино'],
    'Брянская область' => ['Брянск', 'Дятьково', 'Клинцы', 'Новозыбков', 'Сельцо', 'Стародуб']
];

//foreach ($subjectRusFed as $key => $val) {
//    echo '<br><b>' . $key . '</b>:<br>';
//    foreach ($val as $subjectRusFed) {
//        if (!next($val)) { // Выводим точку только после последнего элемента массива
//            echo '&nbsp' . $subjectRusFed . '. ';
//        } else {
//            echo '&nbsp' . $subjectRusFed . ', ';
//        }
//    }
//}

foreach ($subjectRusFed as $key => $val) {
    echo '<br><b>' . $key . '</b>:<br>';
    foreach ($val as $subjectRusFed) {
        if ($subjectRusFed != end($val)) { // Выводим точку только после последнего элемента массива
            echo '&nbsp' . $subjectRusFed . ', ';
        } else {
            echo '&nbsp' . $subjectRusFed . '. ';
        }
    }
}
?>
</p>
<hr><!--======================================================================================-->
<h2>Задание 5</h2>
<pre>
Повторите предыдущее задание, но выводите на экран
только города, начинающиеся с буквы «К».
</pre>
<p>
<h4>Ответ:</h4>
<?php
$subjectRusFed2 = [
    'Приморский край' => ['Владивосток', 'Артем', 'Арсеньев', 'Дальнегорск', 'Находка', 'Уссурийск'],
    'Амурская область' => ['Благовещенск', 'Белогорск', 'Зея', 'Райчихинск', 'Свободный', 'Тында', 'Шимановск'],
    'Костромская область' => ['Кострома', 'Сусанино'],
    'Брянская область' => ['Брянск', 'Дятьково', 'Клинцы', 'Новозыбков', 'Сельцо', 'Стародуб']
];
$fLetter = 'К';
foreach ($subjectRusFed2 as $key => $val) {
    echo '<br><b>' . $key . '</b>:<br>';
    foreach ($val as $subjectRusFed2) {
        if (mb_substr($subjectRusFed2, 0, 1) == $fLetter) {
            echo '&nbsp' . $subjectRusFed2 . ' | ';
        }
    }
}
?>
</p>
<hr><!--======================================================================================-->
<h2>Задание 6</h2>
<pre>
Объявите массив, индексами которого являются буквы русского языка, а
значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’
=> ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Напишите функцию транслитерации строк.
</pre>
<p>
<h4>Ответ:</h4>
<?php
function translit($str) {
    $alphabet = ['а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'ж' => 'zh',
        'з' => 'z', 'и' => 'i', 'й' => 'yi', 'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n', 'о' => 'o', 'п' => 'p',
        'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'u', 'ф' => 'f', 'х' => 'kh', 'ц' => 'ts', 'ч' => 'ch', 'ш' => 'sh',
        'щ' => 'shch', 'ъ' => '`', 'ы' => 'y', 'ь' => '`', 'э' => 'ye', 'ю' => 'yu', 'я' => 'ya'];

    for($i=0;$i<strlen($str);$i++){
        if( (ord($str[$i]) >= 128) && (ord($str[$i]) <= 255) ){
            return strtr(mb_strtolower($str), $alphabet);
        } else {
            return strtr(strtolower($str), array_flip($alphabet));
        }
    }
}
$str = 'Ученье - свет, а неученье - тьма.';
$strEng = 'Uchen`e - svet, a neuchen`e - t`ma.';
echo translit($str) . '<br>';
echo translit($strEng);
?>
</p>
<hr><!--======================================================================================-->
<h2>Задание 7</h2>
<pre>
Напишите функцию, которая заменяет в строке пробелы на подчеркивания и
возвращает видоизмененную строчку.
</pre>
<p>
<h4>Ответ:</h4>
<?php
function underline($str) {
    $space = ' ';
    $underline = '_';
    return str_replace($space, $underline, $str);
}
$string = 'Выпей чайку - забудешь тоску.';
echo underline($string);
?>
</p>
<hr><!--======================================================================================-->
<h2>Задание 8</h2>
<pre>
Объедините две ранее написанные функции в одну, которая получает строку на
русском языке, производит транслитерацию и замену пробелов на подчеркивания
(аналогичная задача решается при конструировании url-адресов на основе названия
статьи в блогах).
</pre>
<p>
<h4>Ответ:</h4>
<?php
//function convertToURL($space, $underline, $str) {
//    $alphabet = ['а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'ж' => 'zh',
//        'з' => 'z', 'и' => 'i', 'й' => 'y', 'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n', 'о' => 'o', 'п' => 'p',
//        'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'u', 'ф' => 'f', 'х' => 'kh', 'ц' => 'ts', 'ч' => 'ch', 'ш' => 'sh',
//        'щ' => 'shch', 'ъ' => '`', 'ы' => 'y', 'ь' => '`', 'э' => 'ye', 'ю' => 'yu', 'я' => 'ya'];
//
//    for($i=0;$i<strlen($str);$i++){
//        if( (ord($str[$i])>=128) && (ord($str[$i])<=255) ){
//            return str_replace( $space, $underline, (strtr(mb_strtolower($str), $alphabet)) );
//        } else {
//            return str_replace( $space, $underline, (strtr(strtolower($str), array_flip($alphabet))) );
//        }
//    }
//}
//$space = ' ';
//$underline = '_';
//$str = 'Ученье - свет, а неученье - тьма.';
//$strEng = 'Uchen`e - svet, a neuchen`e - t`ma.';
//echo convertToURL($space, $underline, $str) . '<br>';
//echo convertToURL($space, $underline, $strEng) . '<br>';


function convertToURL($string) {
    $result = translit(underline($string));
    return $result;
}
$string = 'Выпей чайку - забудешь тоску.';
$stringEng = 'Vypeyi_chayiku_-_zabudesh`_tosku.';
echo convertToURL($string) . '<br>';
echo convertToURL($stringEng);

?>
</p>
</body>
</html>